;-----------------------
;Slot UI popups
;-----------------------

[UIFacility_Storage_SparkSlot_NODD]
m_strRepairTitle=维修单位
m_strRepairText=<XGParam:StrValue0/!UnitName/>可以在这个工程维修间维修，它们仍然可以用于战斗。部署到任务中会暂停维修过程。\n在完成战斗任务后，需要将其放置到维修间以继续维修。\n是否继续？
m_strRepairTitleStop=暂停维修单位?
m_strRepairTextStop=你想暂停维修 %UNITNAME 吗?\n\n警告：需要将单位放置在维修间才能继续维修。
m_strNoSoldiersTooltip=此工程维修间没有可用的单位。 
m_strSoldiersAvailableTooltip=指定一个单位开始维修。

;-----------------------
; STAFF SLOTS
;-----------------------

[SparkStaffSlot X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：建造机械单位"

[SparkStaffSlot1 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

[SparkStaffSlot2 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

[SparkStaffSlot3 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

[SparkStaffSlot4 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

;-----------------------
; DETAILED SOLDIER LISTS
;-----------------------

[X2EventListener_StatusOfRepair]
m_strInRepair = "维修中"
